In [1]:
import numpy as np
import pandas as pd

In [2]:
datasetExample = pd.read_csv('FinalOutput.csv')

### Operation 1:  Use of Relational,logical and comparison oeprations

In [3]:
#1. Extract the records of employees whose esal is greater than 5000

datasetExample[ datasetExample.esal > 5000 ]

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
4,4,Utkarsha,9878,118536,Ops,10371.90,124462.8
5,5,Ajit,9999,119988,HR,10498.95,125987.4

In [4]:
#2. Extract only ename and department of employees whose esal is greater than 5000
datasetExample[ datasetExample.esal > 5000 ].iloc[:,[1,4]]

      ename department
4  Utkarsha        Ops
5      Ajit         HR

In [5]:
#3. Extract those records whose sal is greater than 6500 and belongs to Ops dept
datasetExample[ (datasetExample.esal > 6500) & (datasetExample.department == 'Ops') ]

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
4,4,Utkarsha,9878,118536,Ops,10371.9,124462.8

In [6]:
#4. Display the name of employees whose salary is greater than 6500 and belongs to HR dept
datasetExample[(datasetExample.esal > 6500) & (datasetExample.department == 'HR')].ename

5    Ajit
Name: ename, dtype: object

In [7]:
datasetExample[(datasetExample.esal > 6500) & (datasetExample.department == 'HR')].iloc[:,[1]]

  ename
5  Ajit

In [8]:
datasetExample

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.00,13200.0
1,2,Amar,2000,24000,Ops,2100.00,25200.0
2,3,Chitra,2000,24000,Admin,2100.00,25200.0
3,3,Chitra,2000,24000,Admin,2100.00,25200.0
4,4,Utkarsha,9878,118536,Ops,10371.90,124462.8
5,5,Ajit,9999,119988,HR,10498.95,125987.4

In [9]:
# Replace the salary of the employee as 7000 if the current salary is less than 1500
# assignment

### Operation 2 - Dealing with Duplicate Rows

In [10]:
datasetExample

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.00,13200.0
1,2,Amar,2000,24000,Ops,2100.00,25200.0
2,3,Chitra,2000,24000,Admin,2100.00,25200.0
3,3,Chitra,2000,24000,Admin,2100.00,25200.0
4,4,Utkarsha,9878,118536,Ops,10371.90,124462.8
5,5,Ajit,9999,119988,HR,10498.95,125987.4

In [11]:
datasetExample.drop_duplicates(inplace= True) #Designed only for duplicate rows

In [12]:
datasetExample

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.00,13200.0
1,2,Amar,2000,24000,Ops,2100.00,25200.0
2,3,Chitra,2000,24000,Admin,2100.00,25200.0
4,4,Utkarsha,9878,118536,Ops,10371.90,124462.8
5,5,Ajit,9999,119988,HR,10498.95,125987.4

In [13]:
# The major demerit of DropDuplicate is the index is never reset automatically which may impact the
# fetch cycle of the data when performing EDA or Statistical Modelling.
# So the best practice is to reset the index as soon as DropDuplicate is performed
# U will see next Week ;)

### Operation 3: Performing  Merge Operations iN Pandas

In [14]:
dfExample1 = pd.DataFrame([[4,'QA'],[1,'HR'],[3,'Dev'],[2,'Ops']] , columns=['eid','dept'])

In [15]:
dfExample1

   eid dept
0    4   QA
1    1   HR
2    3  Dev
3    2  Ops

In [16]:
dfExample2 = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['eid','ename'])

In [17]:
dfExample2

   eid     ename
0    1  Prashant
1    2     Gokul
2    3      Guna

In [18]:
# Use-case. I want to perform Join operation of two dfs based on eid
# We will use merge
resultDF = pd.merge(dfExample2,dfExample1)
resultDF
# The merge worked in this case because both dataframe have the common column eid
# that too with the same name

   eid     ename dept
0    1  Prashant   HR
1    2     Gokul  Ops
2    3      Guna  Dev

In [19]:
dept = pd.DataFrame([[4,'QA'],[1,'HR'],[3,'Dev'],[2,'Ops']] , columns=['eid','dept'])
emp = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])

In [20]:
dept

   eid dept
0    4   QA
1    1   HR
2    3  Dev
3    2  Ops

In [21]:
emp

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [22]:
# Use-case. I want to perform Join operation of two dfs based on empid and eid resp.
resultDF2 = pd.merge(emp,dept ,left_on='empid', right_on='eid' )
resultDF2

   empid     ename  eid dept
0      1  Prashant    1   HR
1      2     Gokul    2  Ops
2      3      Guna    3  Dev

In [23]:
finalAnswer = resultDF2.iloc[:,[0,1,3]]

In [24]:
finalAnswer

   empid     ename dept
0      1  Prashant   HR
1      2     Gokul  Ops
2      3      Guna  Dev

In [25]:
resultDF2 = pd.merge(emp,dept ,left_on='empid', right_on='eid')
resultDF2

   empid     ename  eid dept
0      1  Prashant    1   HR
1      2     Gokul    2  Ops
2      3      Guna    3  Dev

### Operation 4 - Concat Operation

In [26]:
empExample = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])

In [27]:
empExample2 = pd.DataFrame([[4,'Nik'],[5,'Ashish'],[6,'Asha']] , columns=['empid','ename'])

In [28]:
empExample

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [29]:
empExample2

   empid   ename
0      4     Nik
1      5  Ashish
2      6    Asha

In [30]:
#Rowwise Concatenation --- Ensure the column names are same in all DFs.
resultEmp = pd.concat( [empExample,empExample2] , axis = 0)
resultEmp

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna
0      4       Nik
1      5    Ashish
2      6      Asha

In [31]:
empExample3 = pd.DataFrame([[4,'Nik'],[5,'Ashish'],[6,'Asha']] , columns=['empid','empname'])
empExample3.columns = ['empid','ename']
resultEmp2 = pd.concat( [empExample,empExample3] , axis = 0)
resultEmp2

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna
0      4       Nik
1      5    Ashish
2      6      Asha

In [32]:
#Columnwise Concat
empExample = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])
dept = pd.DataFrame([['Mumbai','QA'],['Chennai','HR'],['Bangalore','Dev']] , columns=['ecity','dept'])

In [33]:
empExample

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [34]:
dept

       ecity dept
0     Mumbai   QA
1    Chennai   HR
2  Bangalore  Dev

In [35]:
#Columnwise Concatenation --- Ensure the Row Indexes are same in all DFs.
resultEmp3 = pd.concat( [empExample,dept] , axis = 1)
resultEmp3

   empid     ename      ecity dept
0      1  Prashant     Mumbai   QA
1      2     Gokul    Chennai   HR
2      3      Guna  Bangalore  Dev

### Operation 6 --- Deletion

In [36]:
datasetExample

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.00,13200.0
1,2,Amar,2000,24000,Ops,2100.00,25200.0
2,3,Chitra,2000,24000,Admin,2100.00,25200.0
4,4,Utkarsha,9878,118536,Ops,10371.90,124462.8
5,5,Ajit,9999,119988,HR,10498.95,125987.4

In [37]:
#Column Deletion (axis = 1) ---> UpdatedYearlySalary

datasetExample.drop(['UpdatedSalary','UpdatedYearlySalary'] , axis = 1 , inplace=True)

In [38]:
?datasetExample.drop

In [39]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops
5    5      Ajit  9999        119988         HR

In [40]:
#Row Deletion (axis=0)
datasetExample.drop([5] , axis=0, inplace=True)

In [41]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops

In [42]:
datasetExample.drop( datasetExample[datasetExample.eid == 3].index , axis=0)

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
4    4  Utkarsha  9878        118536        Ops

In [43]:
datasetExample.iloc[:,3:6].index

Int64Index([0, 1, 2, 4], dtype='int64')